ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define CPT0MX_CMXN__FMASK  0xF0 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__SHIFT  0x04 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__CMP0N0 0x00 ///< External pin CMP0N.0.                  
#define CPT0MX_CMXN__CMP0N1 0x10 ///< External pin CMP0N.1.                  
#define CPT0MX_CMXN__CMP0N2 0x20 ///< External pin CMP0N.2.                  
#define CPT0MX_CMXN__CMP0N3 0x30 ///< External pin CMP0N.3.                  
#define CPT0MX_CMXN__CMP0N4 0x40 ///< External pin CMP0N.4.                  
#define CPT0MX_CMXN__CMP0N5 0x50 ///< External pin CMP0N.5.                  
#define CPT0MX_CMXN__CMP0N6 0x60 ///< External pin CMP0N.6.                  
#define CPT0MX_CMXN__CMP0N7 0x70 ///< External pin CMP0N.7.                  
#define CPT0MX_CMXN__CMP0N8 0x80 ///< External pin CMP0N.8.                  
#define CPT0MX_CMXN__CMP0N9 0x90 ///< External pin CMP0N.9.                  
#define CPT0MX_CMXN__NONE   0xF0 ///< No input selected.                     
                                                                             
//------------------------------------------------------------------------------
// CRC0AUTO Enums (CRC0 Automatic Control @ 0xDD)
//------------------------------------------------------------------------------
#define CRC0AUTO_CRCST__FMASK     0x3F ///< Automatic CRC Calculation Starting Block  
#define CRC0AUTO_CRCST__SHIFT     0x00 ///< Automatic CRC Calculation Starting Block  
                                                                                      
#define CRC0AUTO_AUTOEN__BMASK    0x80 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__SHIFT    0x07 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__DISABLED 0x00 ///< Disable automatic CRC operations on flash.
#define CRC0AUTO_AUTOEN__ENABLED  0x80 ///< Enable automatic CRC operations on flash. 
                                                                                      
//------------------------------------------------------------------------------
// CRC0CN Enums (CRC0 Control @ 0xDF)
//------------------------------------------------------------------------------
#define CRC0CN_CRCPNT__BMASK        0x01 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__ACCESS_LOWER 0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit CRC      
                                         ///< result.                                          
#define CRC0CN_CRCPNT__ACCESS_UPPER 0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit CRC     
                                         ///< result.                                          
                                                                                               
#define CRC0CN_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x0000 on write of 1 to     
                                         ///< CRCINIT.                                         
#define CRC0CN_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFF on write of 1 to     
                                         ///< CRCINIT.                                         
                                                                                               
#define CRC0CN_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                
#define CRC0CN_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased
                                         ///< on the value of CRCVAL.                          
                                                                                               
//------------------------------------------------------------------------------
// CRC0CNT Enums (CRC0 Automatic Flash Sector Count @ 0xDE)
//------------------------------------------------------------------------------
#define CRC0CNT_CRCCNT__FMASK  0x1F ///< Automatic CRC Calculation Block Count
#define CRC0CNT_CRCCNT__SHIFT  0x00 ///< Automatic CRC Calculation Block Count
                                                                              
#define CRC0CNT_CRCDN__BMASK   0x80 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__SHIFT   0x07 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__NOT_SET 0x00 ///< A CRC calculation is in progress.    
#define CRC0CNT_CRCDN__SET     0x80 ///< A CRC calculation is not in progress.
                                                                              
//------------------------------------------------------------------------------
// CRC0DAT Enums (CRC0 Data Output @ 0x9E)
//------------------------------------------------------------------------------
#define CRC0DAT_CRC0DAT__FMASK 0xFF ///< CRC Data Output
#define CRC0DAT_CRC0DAT__SHIFT 0x00 ///< CRC Data Output
                                                        
//------------------------------------------------------------------------------
// CRC0FLIP Enums (CRC0 Bit Flip @ 0x9A)
//------------------------------------------------------------------------------
#define CRC0FLIP_CRC0FLIP__FMASK 0xFF ///< CRC0 Bit Flip
#define CRC0FLIP_CRC0FLIP__SHIFT 0x00 ///< CRC0 Bit Flip
                                                        
//------------------------------------------------------------------------------
// CRC0IN Enums (CRC0 Data Input @ 0x9C)
//------------------------------------------------------------------------------
#define CRC0IN_CRC0IN__FMASK 0xFF ///< CRC Data Input
#define CRC0IN_CRC0IN__SHIFT 0x00 ///< CRC Data Input
                                                     
//------------------------------------------------------------------------------
// DERIVID Enums (Device Derivative ID @ 0xAB)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK      0xFF ///< Derivative ID
#define DERIVID_DERIVID__SHIFT      0x00 ///< Derivative ID
#define DERIVID_DERIVID__C8051F390  0xD0 ///< C8051F390    
#define DERIVID_DERIVID__C8051F391  0xD1 ///< C8051F391    
#define DERIVID_DERIVID__C8051F392  0xD2 ///< C8051F392    
#define DERIVID_DERIVID__C8051F393  0xD3 ///< C8051F393    
#define DERIVID_DERIVID__C8051F394  0xD4 ///< C8051F394    
#define DERIVID_DERIVID__C8051F395  0xD5 ///< C8051F395    
#define DERIVID_DERIVID__C8051F396  0xD6 ///< C8051F396    
#define DERIVID_DERIVID__C8051F397  0xD7 ///< C8051F397    
#define DERIVID_DERIVID__C8051F398  0xD8 ///< C8051F398    
#define DERIVID_DERIVID__C8051F399  0xD9 ///< C8051F399    
#define DERIVID_DERIVID__C8051F370  0xE0 ///< C8051F370    
#define DERIVID_DERIVID__C8051F371  0xE1 ///< C8051F371    
#define DERIVID_DERIVID__C8051F374  0xE4 ///< C8051F374    
#define DERIVID_DERIVID__C8051F375  0xE5 ///< C8051F375    
                                                           
//------------------------------------------------------------------------------
// REVISION Enums (Revision Identifcation @ 0xAC)
//------------------------------------------------------------------------------
#define REVISION_REVISION__FMASK 0xFF ///< Revision Identification
#define REVISION_REVISION__SHIFT 0x00 ///< Revision Identification
#define REVISION_REVISION__REV_A 0x00 ///< Revision A             
                                                                  
//------------------------------------------------------------------------------
// SN0 Enums (Serial Number Byte 0 @ 0xAB)
//------------------------------------------------------------------------------
#define SN0_SN0__FMASK 0xFF ///< Serial Number Byte 0
#define SN0_SN0__SHIFT 0x00 ///< Serial Number Byte 0
                                                     
//------------------------------------------------------------------------------
// SN1 Enums (Serial Number Byte 1 @ 0xAC)
//------------------------------------------------------------------------------
#define SN1_SN1__FMASK 0xFF ///< Serial Number Byte 1
#define SN1_SN1__SHIFT 0x00 ///< Serial Number Byte 1
                                                     
//------------------------------------------------------------------------------
// SN2 Enums (Serial Number Byte 2 @ 0xAD)
//------------------------------------------------------------------------------
#define SN2_SN2__FMASK 0xFF ///< Serial Number Byte 2
#define SN2_SN2__SHIFT 0x00 ///< Serial Number Byte 2
                                                     
//------------------------------------------------------------------------------
// SN3 Enums (Serial Number Byte 3 @ 0xAE)
//------------------------------------------------------------------------------
#define SN3_SN3__FMASK 0xFF ///< Serial Number Byte 3
#define SN3_SN3__SHIFT 0x00 ///< Serial Number Byte 3
                                                     
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
