ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define IDA1CN_IDARP__BMASK               0x04 ///< Reset Persistence Enable                          
#define IDA1CN_IDARP__SHIFT               0x02 ///< Reset Persistence Enable                          
#define IDA1CN_IDARP__DISABLED            0x00 ///< IDAC1 is disabled by any reset source.            
#define IDA1CN_IDARP__ENABLED             0x04 ///< IDAC1 will remain enabled through any reset source
                                               ///< except a power-on-reset.                          
                                                                                                      
#define IDA1CN_IDACM__FMASK               0x70 ///< Update Source Select                              
#define IDA1CN_IDACM__SHIFT               0x04 ///< Update Source Select                              
#define IDA1CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.           
#define IDA1CN_IDACM__TIMER5              0x10 ///< DAC output updates on Timer 5 overflow.           
#define IDA1CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.           
#define IDA1CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.           
#define IDA1CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR.      
#define IDA1CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR.     
#define IDA1CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.         
#define IDA1CN_IDACM__IDA1H               0x70 ///< DAC output updates on write to IDA1H.             
                                                                                                      
#define IDA1CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                       
#define IDA1CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                       
#define IDA1CN_IDAEN__DISABLED            0x00 ///< Disable IDAC1.                                    
#define IDA1CN_IDAEN__ENABLED             0x80 ///< Enable IDAC1.                                     
                                                                                                      
//------------------------------------------------------------------------------
// IDA1H Enums (IDAC1 Data High Byte @ 0x97)
//------------------------------------------------------------------------------
#define IDA1H_IDA1__FMASK 0xFF ///< IDAC1 Data High
#define IDA1H_IDA1__SHIFT 0x00 ///< IDAC1 Data High
                                                   
//------------------------------------------------------------------------------
// IDA1L Enums (IDAC1 Data Low Byte @ 0x96)
//------------------------------------------------------------------------------
#define IDA1L_IDA1__FMASK 0xC0 ///< IDA1 Data Low
#define IDA1L_IDA1__SHIFT 0x06 ///< IDA1 Data Low
                                                 
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                
#define EIE1_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port     
                                   ///< Match.                                            
                                                                                          
#define EIE1_EWADC0__BMASK    0x04 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x02 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x04 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x08 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x03 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x08 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE1_EPCA0__BMASK     0x10 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x10 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0__BMASK      0x20 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__SHIFT      0x05 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__DISABLED   0x00 ///< Disable CP0 interrupts.                           
#define EIE1_ECP0__ENABLED    0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF or CPFIF flags.                
                                                                                          
