ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xAF)
//------------------------------------------------------------------------------
#define EIE2_ESMB1__BMASK    0x01 ///< SMBus (SMB1) Interrupt Enable                     
#define EIE2_ESMB1__SHIFT    0x00 ///< SMBus (SMB1) Interrupt Enable                     
#define EIE2_ESMB1__DISABLED 0x00 ///< Disable all SMB1 interrupts.                      
#define EIE2_ESMB1__ENABLED  0x01 ///< Enable interrupt requests generated by SMB1.      
                                                                                         
#define EIE2_ET4__BMASK      0x02 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__SHIFT      0x01 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__DISABLED   0x00 ///< Disable Timer 4 interrupts.                       
#define EIE2_ET4__ENABLED    0x02 ///< Enable interrupt requests generated by the TF4L or
                                  ///< TF4H flags.                                       
                                                                                         
#define EIE2_ET5__BMASK      0x04 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__SHIFT      0x02 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__DISABLED   0x00 ///< Disable Timer 5 interrupts.                       
#define EIE2_ET5__ENABLED    0x04 ///< Enable interrupt requests generated by the TF5L or
                                  ///< TF5H flags.                                       
                                                                                         
#define EIE2_EPTS__BMASK     0x08 ///< Precision Temperature Sensor Interrupt Enable     
#define EIE2_EPTS__SHIFT     0x03 ///< Precision Temperature Sensor Interrupt Enable     
#define EIE2_EPTS__DISABLED  0x00 ///< Disable Precision Temperature Sensor interrupts.  
#define EIE2_EPTS__ENABLED   0x08 ///< Enable interrupt requests generated by the        
                                  ///< Precision Temperature Sensor.                     
                                                                                         
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control LSB                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control LSB                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt priority LSB set to low.                         
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt priority LSB set to high.                        
                                                                                                     
#define EIP1_PMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control LSB                       
#define EIP1_PMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control LSB                       
#define EIP1_PMAT__LOW     0x00 ///< Port Match interrupt priority LSB set to low.                   
#define EIP1_PMAT__HIGH    0x02 ///< Port Match interrupt priority LSB set to high.                  
                                                                                                     
#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control LSB           
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control LSB           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt priority LSB set to low.                  
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Window interrupt priority LSB set to high.                 
                                                                                                     
#define EIP1_PADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control LSB         
#define EIP1_PADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control LSB         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority LSB                 
                                ///< set to low.                                                     
#define EIP1_PADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt priority LSB                 
                                ///< set to high.                                                    
                                                                                                     
#define EIP1_PPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt priority LSB set to low.                         
#define EIP1_PPCA0__HIGH   0x10 ///< PCA0 interrupt priority LSB set to high.                        
                                                                                                     
#define EIP1_PCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control LSB                
#define EIP1_PCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control LSB                
#define EIP1_PCP0__LOW     0x00 ///< CP0 interrupt priority LSB set to low.                          
#define EIP1_PCP0__HIGH    0x20 ///< CP0 interrupt priority LSB set to high.                         
                                                                                                     
#define EIP1_PT3__BMASK    0x80 ///< Timer 3 Interrupt Priority Control LSB                          
#define EIP1_PT3__SHIFT    0x07 ///< Timer 3 Interrupt Priority Control LSB                          
#define EIP1_PT3__LOW      0x00 ///< Timer 3 interrupt priority LSB set to low.                      
#define EIP1_PT3__HIGH     0x80 ///< Timer 3 interrupt priority LSB set to high.                     
                                                                                                     
//------------------------------------------------------------------------------
// EIP1H Enums (Extended Interrupt Priority 1 High @ 0x85)
//------------------------------------------------------------------------------
#define EIP1H_PHSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control MSB                     
#define EIP1H_PHSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control MSB                     
#define EIP1H_PHSMB0__LOW    0x00 ///< SMB0 interrupt priority MSB set to low.                         
#define EIP1H_PHSMB0__HIGH   0x01 ///< SMB0 interrupt priority MSB set to high.                        
                                                                                                       
