ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define EIP1H_PHMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control MSB                       
#define EIP1H_PHMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control MSB                       
#define EIP1H_PHMAT__LOW     0x00 ///< Port Match interrupt priority MSB set to low.                   
#define EIP1H_PHMAT__HIGH    0x02 ///< Port Match interrupt priority MSB set to high.                  
                                                                                                       
#define EIP1H_PHWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control MSB           
#define EIP1H_PHWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control MSB           
#define EIP1H_PHWADC0__LOW   0x00 ///< ADC0 Window interrupt priority MSB set to low.                  
#define EIP1H_PHWADC0__HIGH  0x04 ///< ADC0 Window interrupt priority MSB set to high.                 
                                                                                                       
#define EIP1H_PHADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control MSB         
#define EIP1H_PHADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control MSB         
#define EIP1H_PHADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority MSB                 
                                  ///< set to low.                                                     
#define EIP1H_PHADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt priority MSB                 
                                  ///< set to high.                                                    
                                                                                                       
#define EIP1H_PHPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control MSB
#define EIP1H_PHPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control MSB
#define EIP1H_PHPCA0__LOW    0x00 ///< PCA0 interrupt priority MSB set to low.                         
#define EIP1H_PHPCA0__HIGH   0x10 ///< PCA0 interrupt priority MSB set to high.                        
                                                                                                       
#define EIP1H_PHCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control MSB                
#define EIP1H_PHCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control MSB                
#define EIP1H_PHCP0__LOW     0x00 ///< CP0 interrupt priority MSB set to low.                          
#define EIP1H_PHCP0__HIGH    0x20 ///< CP0 interrupt priority MSB set to high.                         
                                                                                                       
#define EIP1H_PHT3__BMASK    0x80 ///< Timer 3 Interrupt Priority Control MSB                          
#define EIP1H_PHT3__SHIFT    0x07 ///< Timer 3 Interrupt Priority Control MSB                          
#define EIP1H_PHT3__LOW      0x00 ///< Timer 3 interrupt priority MSB set to low.                      
#define EIP1H_PHT3__HIGH     0x80 ///< Timer 3 interrupt priority MSB set to high.                     
                                                                                                       
//------------------------------------------------------------------------------
// EIP2 Enums (Extended Interrupt Priority 2 @ 0xBF)
//------------------------------------------------------------------------------
#define EIP2_PSMB1__BMASK 0x01 ///< SMBus (SMB1) Interrupt Priority Control LSB                
#define EIP2_PSMB1__SHIFT 0x00 ///< SMBus (SMB1) Interrupt Priority Control LSB                
#define EIP2_PSMB1__LOW   0x00 ///< SMB1 interrupt priority LSB set to low.                    
#define EIP2_PSMB1__HIGH  0x01 ///< SMB1 interrupt priority LSB set to high.                   
                                                                                               
#define EIP2_PT4__BMASK   0x02 ///< Timer 4 Interrupt Priority Control LSB                     
#define EIP2_PT4__SHIFT   0x01 ///< Timer 4 Interrupt Priority Control LSB                     
#define EIP2_PT4__LOW     0x00 ///< Timer 4 interrupt priority LSB set to low.                 
#define EIP2_PT4__HIGH    0x02 ///< Timer 4 interrupt priority LSB set to high.                
                                                                                               
#define EIP2_PT5__BMASK   0x04 ///< Timer 5 Interrupt Priority Control LSB                     
#define EIP2_PT5__SHIFT   0x02 ///< Timer 5 Interrupt Priority Control LSB                     
#define EIP2_PT5__LOW     0x00 ///< Timer 5 interrupt priority LSB set to low.                 
#define EIP2_PT5__HIGH    0x04 ///< Timer 5 interrupt priority LSB set to high.                
                                                                                               
#define EIP2_PPTS__BMASK  0x08 ///< Precision Temperature Sensor Interrupt Priority Control LSB
#define EIP2_PPTS__SHIFT  0x03 ///< Precision Temperature Sensor Interrupt Priority Control LSB
#define EIP2_PPTS__LOW    0x00 ///< Precision Temperature Sensor interrupt priority            
                               ///< LSB set to low.                                            
#define EIP2_PPTS__HIGH   0x08 ///< Precision Temperature Sensor interrupt priority            
                               ///< LSB set to high.                                           
                                                                                               
//------------------------------------------------------------------------------
// EIP2H Enums (Extended Interrupt Priority 2 High @ 0x86)
//------------------------------------------------------------------------------
#define EIP2H_PHSMB1__BMASK 0x01 ///< SMBus (SMB1) Interrupt Priority Control MSB                
#define EIP2H_PHSMB1__SHIFT 0x00 ///< SMBus (SMB1) Interrupt Priority Control MSB                
#define EIP2H_PHSMB1__LOW   0x00 ///< SMB1 interrupt priority MSB set to low.                    
#define EIP2H_PHSMB1__HIGH  0x01 ///< SMB1 interrupt priority MSB set to high.                   
                                                                                                 
