ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define OSCLCN_OSCLRDY__BMASK     0x40 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__SHIFT     0x06 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__NOT_SET   0x00 ///< Low Frequency Oscillator frequency is not stable.
#define OSCLCN_OSCLRDY__SET       0x40 ///< Low Frequency Oscillator frequency is stable.    
                                                                                             
#define OSCLCN_OSCLEN__BMASK      0x80 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__SHIFT      0x07 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__DISABLED   0x00 ///< Disable the Low Frequency Oscillator.            
#define OSCLCN_OSCLEN__ENABLED    0x80 ///< Enable the Low Frequency Oscillator.             
                                                                                             
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK     0x01 ///< UART I/O Output Enable                        
#define XBR0_URT0E__SHIFT     0x00 ///< UART I/O Output Enable                        
#define XBR0_URT0E__DISABLED  0x00 ///< UART I/O unavailable at Port pin.             
#define XBR0_URT0E__ENABLED   0x01 ///< UART TX, RX routed to Port pins P0.4 and P0.5.
                                                                                      
#define XBR0_SPI0E__BMASK     0x02 ///< SPI I/O Enable                                
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI I/O Enable                                
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.             
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be   
                                   ///< assigned either 3 or 4 GPIO pins.             
                                                                                      
#define XBR0_SMB0E__BMASK     0x04 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__SHIFT     0x02 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus0 I/O unavailable at Port pins.          
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus0 I/O routed to Port pins.               
                                                                                      
#define XBR0_SYSCKE__BMASK    0x08 ///< SYSCLK Output Enable                          
#define XBR0_SYSCKE__SHIFT    0x03 ///< SYSCLK Output Enable                          
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.               
#define XBR0_SYSCKE__ENABLED  0x08 ///< SYSCLK output routed to Port pin.             
                                                                                      
#define XBR0_CP0E__BMASK      0x10 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__SHIFT      0x04 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.                  
#define XBR0_CP0E__ENABLED    0x10 ///< CP0 routed to Port pin.                       
                                                                                      
#define XBR0_CP0AE__BMASK     0x20 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__SHIFT     0x05 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.     
#define XBR0_CP0AE__ENABLED   0x20 ///< Asynchronous CP0 routed to Port pin.          
                                                                                      
#define XBR0_SMB1E__BMASK     0x40 ///< SMBus1 I/O Enable                             
#define XBR0_SMB1E__SHIFT     0x06 ///< SMBus1 I/O Enable                             
#define XBR0_SMB1E__DISABLED  0x00 ///< SMBus1 I/O unavailable at Port pins.          
#define XBR0_SMB1E__ENABLED   0x40 ///< SMBus1 I/O routed to Port pins.               
                                                                                      
#define XBR0_EEPUE__BMASK     0x80 ///< EEPROM Pullup Enable                          
#define XBR0_EEPUE__SHIFT     0x07 ///< EEPROM Pullup Enable                          
#define XBR0_EEPUE__DISABLED  0x00 ///< On-chip strong pullups not active.            
#define XBR0_EEPUE__ENABLED   0x80 ///< On-chip strong pullups active on pins P2.2 and
                                   ///< P2.3.                                         
                                                                                      
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_PCA0ME__FMASK              0x03 ///< PCA Module I/O Enable                           
#define XBR1_PCA0ME__SHIFT              0x00 ///< PCA Module I/O Enable                           
#define XBR1_PCA0ME__DISABLED           0x00 ///< All PCA I/O unavailable at Port pins.           
#define XBR1_PCA0ME__CEX0               0x01 ///< CEX0 routed to Port pin.                        
#define XBR1_PCA0ME__CEX0_CEX1          0x02 ///< CEX0, CEX1 routed to Port pins.                 
#define XBR1_PCA0ME__CEX0_CEX1_CEX2     0x03 ///< CEX0, CEX1, CEX2 routed to Port pins.           
                                                                                                  
#define XBR1_ECIE__BMASK                0x08 ///< PCA0 External Counter Input Enable              
#define XBR1_ECIE__SHIFT                0x03 ///< PCA0 External Counter Input Enable              
#define XBR1_ECIE__DISABLED             0x00 ///< ECI unavailable at Port pin.                    
#define XBR1_ECIE__ENABLED              0x08 ///< ECI routed to Port pin.                         
                                                                                                  
#define XBR1_T0E__BMASK                 0x10 ///< T0 Enable                                       
#define XBR1_T0E__SHIFT                 0x04 ///< T0 Enable                                       
#define XBR1_T0E__DISABLED              0x00 ///< T0 unavailable at Port pin.                     
#define XBR1_T0E__ENABLED               0x10 ///< T0 routed to Port pin.                          
                                                                                                  
