ahtn/keyplus/ports/efm8/efm8/mcu/C8051F390/inc/SI_C8051F390_Register_Enums.h
#define P2MDOUT_B3__BMASK      0x08 ///< Port 2 Bit 3 Output Mode  
#define P2MDOUT_B3__SHIFT      0x03 ///< Port 2 Bit 3 Output Mode  
#define P2MDOUT_B3__OPEN_DRAIN 0x00 ///< P2.3 output is open-drain.
#define P2MDOUT_B3__PUSH_PULL  0x08 ///< P2.3 output is push-pull. 
                                                                   
#define P2MDOUT_B4__BMASK      0x10 ///< Port 2 Bit 4 Output Mode  
#define P2MDOUT_B4__SHIFT      0x04 ///< Port 2 Bit 4 Output Mode  
#define P2MDOUT_B4__OPEN_DRAIN 0x00 ///< P2.4 output is open-drain.
#define P2MDOUT_B4__PUSH_PULL  0x10 ///< P2.4 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P2SKIP Enums (Port 2 Skip @ 0xD6)
//------------------------------------------------------------------------------
#define P2SKIP_B0__BMASK       0x01 ///< Port 2 Bit 0 Skip                       
#define P2SKIP_B0__SHIFT       0x00 ///< Port 2 Bit 0 Skip                       
#define P2SKIP_B0__NOT_SKIPPED 0x00 ///< P2.0 pin is not skipped by the crossbar.
#define P2SKIP_B0__SKIPPED     0x01 ///< P2.0 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B1__BMASK       0x02 ///< Port 2 Bit 1 Skip                       
#define P2SKIP_B1__SHIFT       0x01 ///< Port 2 Bit 1 Skip                       
#define P2SKIP_B1__NOT_SKIPPED 0x00 ///< P2.1 pin is not skipped by the crossbar.
#define P2SKIP_B1__SKIPPED     0x02 ///< P2.1 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B2__BMASK       0x04 ///< Port 2 Bit 2 Skip                       
#define P2SKIP_B2__SHIFT       0x02 ///< Port 2 Bit 2 Skip                       
#define P2SKIP_B2__NOT_SKIPPED 0x00 ///< P2.2 pin is not skipped by the crossbar.
#define P2SKIP_B2__SKIPPED     0x04 ///< P2.2 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B3__BMASK       0x08 ///< Port 2 Bit 3 Skip                       
#define P2SKIP_B3__SHIFT       0x03 ///< Port 2 Bit 3 Skip                       
#define P2SKIP_B3__NOT_SKIPPED 0x00 ///< P2.3 pin is not skipped by the crossbar.
#define P2SKIP_B3__SKIPPED     0x08 ///< P2.3 pin is skipped by the crossbar.    
                                                                                 
#define P2SKIP_B4__BMASK       0x10 ///< Port 2 Bit 4 Skip                       
#define P2SKIP_B4__SHIFT       0x04 ///< Port 2 Bit 4 Skip                       
#define P2SKIP_B4__NOT_SKIPPED 0x00 ///< P2.4 pin is not skipped by the crossbar.
#define P2SKIP_B4__SKIPPED     0x10 ///< P2.4 pin is skipped by the crossbar.    
                                                                                 
//------------------------------------------------------------------------------
// TS0CN Enums (Temperature Sensor Control @ 0xD2)
//------------------------------------------------------------------------------
#define TS0CN_TSCNVL__FMASK  0x07 ///< Temperature Sensor Conversion Length             
#define TS0CN_TSCNVL__SHIFT  0x00 ///< Temperature Sensor Conversion Length             
                                                                                        
#define TS0CN_TSDN__BMASK    0x40 ///< Temperature Sensor Finished Flag                 
#define TS0CN_TSDN__SHIFT    0x06 ///< Temperature Sensor Finished Flag                 
#define TS0CN_TSDN__NOT_SET  0x00 ///< A temperature sensor measurement is not complete.
#define TS0CN_TSDN__SET      0x40 ///< A temperature sensor measurement completed.      
                                                                                        
#define TS0CN_TSSTRT__BMASK  0x80 ///< Temperature Sensor Start                         
#define TS0CN_TSSTRT__SHIFT  0x07 ///< Temperature Sensor Start                         
#define TS0CN_TSSTRT__START2 0x00 ///< Firmware must set this bit to 1, then clear this 
                                  ///< bit to 0 to start a temperature sensor           
                                  ///< measurement.                                     
#define TS0CN_TSSTRT__START1 0x80 ///< Firmware must set this bit to 1, then clear this 
                                  ///< bit to 0 to start a temperature sensor           
                                  ///< measurement.                                     
                                                                                        
//------------------------------------------------------------------------------
// TS0DATH Enums (Temperature Sensor Output High Byte @ 0xD3)
//------------------------------------------------------------------------------
#define TS0DATH_TS0DATH__FMASK 0xFF ///< Temperature Sensor Output High Byte
#define TS0DATH_TS0DATH__SHIFT 0x00 ///< Temperature Sensor Output High Byte
                                                                            
//------------------------------------------------------------------------------
// TS0DATL Enums (Temperature Sensor Output Low Byte @ 0xD2)
//------------------------------------------------------------------------------
#define TS0DATL_TS0DATL__FMASK 0xFF ///< Temperature Sensor Output Low Byte
#define TS0DATL_TS0DATL__SHIFT 0x00 ///< Temperature Sensor Output Low Byte
                                                                           
//------------------------------------------------------------------------------
// RSTSRC Enums (Reset Source @ 0xEF)
//------------------------------------------------------------------------------
#define RSTSRC_PINRSF__BMASK   0x01 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__SHIFT   0x00 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__NOT_SET 0x00 ///< The /RST pin did not cause the last reset.                           
#define RSTSRC_PINRSF__SET     0x01 ///< The /RST pin caused the last reset.                                  
                                                                                                              
#define RSTSRC_PORSF__BMASK    0x02 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__SHIFT    0x01 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__NOT_SET  0x00 ///< A power-on or supply monitor reset did not occur.                    
#define RSTSRC_PORSF__SET      0x02 ///< A power-on or supply monitor reset occurred.                         
                                                                                                              
